#include "iotest.hpp"

int main() {
    test_exact("0 0 1 1 0 1 1 0",    "Прямые перпендикулярны");
    test_exact("0 0 2 1 1 1 3 2",    "Прямые параллельны");
    test_exact("1 2 4 2 2 1 2 5",    "Прямые перпендикулярны");
    test_exact("2 0 2 5 -1 1 -1 4",  "Прямые параллельны");
    test_exact("0 0 2 2 1 1 3 3",    "Прямые параллельны");
    test_exact("1 1 2 2 1 2 2 1",    "Прямые перпендикулярны");
    test_exact("1.5 2.3 3.7 4.1 -0.5 1.2 2.3 3.8", "Прямые пересекаются под некоторым углом");
    test_contains("1 1 1 1 0 0 2 2", "Ошибка");
}
