#include "iotest.hpp"

int main() {
    test_num_array("3 0 0 0 1 4 0 0 1 8 0 0 1",       "x = 4 y = 0 z = 0", KEEP_ORDER);
    test_num_array("2 0 0 0 1 10 0 0 3",              "x = 7.5 y = 0 z = 0", KEEP_ORDER);
    test_num_array("1 1 2 3 4",                       "x = 1 y = 2 z = 3", KEEP_ORDER);
    test_num_array("2 1 2 3 4 5 6 7 8",               "x = 3.66667 y = 4.66667 z = 5.66667", KEEP_ORDER);
    test_num_array("3 0 0 0 100 100 0 0 1 0 100 0 1", "x = 0.980392 y = 0.980392 z = 0", KEEP_ORDER);
    test_num_array("6 23 2.4 4 756 5.5 77 2345 9 63 72 0.5 6367 12 34 56 78 1 2 3 4 9 8 7 6", "x = 58.1098 y = 64.216 z = 4.39536", KEEP_ORDER);
    test_contains("-1",                               "Ошибка");
    test_contains("2 1 2 3 0 4 5 6 0",                "Ошибка");
}

/*
Ввод:
3
0 0 0 1
4 0 0 1
8 0 0 1
Вывод:
x = 4
y = 0
z = 0

Формулу для вычисления центра масс можно найти в приложении.
Необходимо использовать вещественный тип данных с двойной точностью.
В случае ввода некорректного числа программа должна выводить слово "Ошибка" и пояснить, что пошло не так.
*/
