#include "iotest.hpp"

int main() {
    test_exact("2 2 1 1 1 2 -1 3 2",                    "7 + 9i");
    test_exact("0 0 0 3 4",                             "3 + 4i");
    test_exact("1 0 0 1 0 2 0",                         "2 + 0i");
    test_exact("1 2 3 1 0 5 0",                         "7 + 3i");
    test_exact("2 0 1 0 1 0 0 0 0",                     "0 - 1i");
    test_exact("1 3 4 1 1 2 2",                         "1 + 9i");
    test_exact("3 2 -1 -1 -2 3 -4 -5 6 7 -8",           "-28 - 8i");
    test_exact("2 0.5 -0.25 0.1 0.2 -0.3 0.4 0.5 -0.6", "0.51875 - 0.3125i");
    test_exact("2 1 0 2 0 3 0 4 0",                     "9 + 0i");
    test_contains("-1",                                 "Ошибка");
}

/*
Ввод:
2    // n
2 1  // x y
1 1  // a0 b0
2 -1 // a1 b1
3 2  // a2 b2
Вывод:
7 + 9i

В случае ввода некорректного числа программа должна выводить слово "Ошибка" и пояснить, что пошло не так.
*/
