#include "iotest.hpp"

int main() {
    test_num_array("6",       "1 1 3 11 5 101");
    test_num_array("7",       "1 1 3 11 5 101");
    test_num_array("1",       "");
    test_num_array("100",     "1 1 3 11 5 101 7 111 9 1001 33 100001 99 1100011");
    test_num_array("717",     "1 1 3 11 5 101 7 111 9 1001 33 100001 99 1100011 313 100111001 585 1001001001");
    test_num_array("1000000", "1 1 3 11 5 101 7 111 9 1001 33 100001 99 1100011 313 100111001 585 1001001001 717 1011001101 7447 1110100010111 9009 10001100110001 15351 11101111110111 32223 111110111011111 39993 1001110000111001 53235 1100111111110011 53835 1101001001001011 73737 10010000000001001 585585 10001110111101110001");
    test_contains("0",        "Ошибка");
    test_contains("-1",       "Ошибка");
}

/*
Ввод:
6
Вывод:
1 1
3 11
5 101

В случае ввода некорректного числа программа должна выводить слово "Ошибка" и пояснить, что пошло не так.
*/
