#include "iotest.hpp"

int main() {
    test_num_array("5 1 1 0 0 4 0 4 4 0 4",                              "(0 0) (4 0) (4 4) (0 4)", KEEP_ORDER);
    test_num_array("9 0 0 0 1 1 0 1 1 2 2 2 3 3 2 3 3 7 7",              "(0 0) (0 1) (1 0) (1 1) (2 2) (2 3) (3 2) (3 3)", KEEP_ORDER);
    test_num_array("7 0 0 4 0 4 4 0 4 5 4 5 5 4 5",                      "(0 0) (4 0) (4 4) (0 4) (4 4) (5 4) (5 5) (4 5)", KEEP_ORDER);
    test_num_array("4 0 7 7 0 14 7 7 14",                                "(0 7) (7 0) (14 7) (7 14)", KEEP_ORDER);
    test_num_array("4 0 0 0 2 1 0 1 2",                                  "", KEEP_ORDER);
    test_num_array("6 32 -1 0 5 -5 6 9 9 13 12 44 -44",                  "", KEEP_ORDER);
    test_num_array("12 0 0 0 1 1 0 1 1 0 2 0 3 1 2 1 3 2 0 2 1 3 0 3 1", "(0 0) (0 1) (1 0) (1 1) (0 1) (1 0) (1 2) (2 1) (0 1) (1 1) (0 2) (1 2) (1 0) (1 1) (2 0) (2 1) (0 2) (0 3) (1 2) (1 3) (2 0) (2 1) (3 0) (3 1)", KEEP_ORDER);
    test_num_array("4 -1 -1 -1 0 0 -1 0 0",                              "(-1 -1) (-1 0) (0 -1) (0 0)", KEEP_ORDER);
    test_contains("3",                                                   "Ошибка");
    test_contains("0",                                                   "Ошибка");
}

/*
Ввод:
9
0 0 0 1 1 0 1 1 2 2 2 3 3 2 3 3 7 7
Вывод:
(0 0) (0 1) (1 0) (1 1)
(2 2) (2 3) (3 2) (3 3)

В случае ввода некорректного числа программа должна выводить слово "Ошибка" и пояснить, что пошло не так.
*/
