#include "iotest.hpp"

int main() {
    test_exact("1 93",                       "10010011");
    test_num_array("2 011000000111",         "607");
    test_exact("1 0",                        "0000");
    test_exact("1 29",                       "00101001");
    test_exact("1 255",                      "001001010101");
    test_exact("1 999",                      "100110011001");
    test_exact("1 1000",                     "0001000000000000");
    test_exact("1 2026",                     "0010000000100110");
    test_num_array("2 0000",                 "0");
    test_num_array("2 00010011",             "13");
    test_num_array("2 000100100011",         "123");
    test_num_array("2 010101010101",         "555");
    test_num_array("2 0010000000000000",     "2000");
    test_num_array("2 01010110011110001001", "56789");
    test_contains("1 -1",                    "Ошибка");
    test_contains("2 1010",                  "Ошибка");
    test_contains("2 10011010",              "Ошибка");
    test_contains("2 11",                    "Ошибка");
    test_contains("2 01101",                 "Ошибка");
}

/*
Ввод:
1
93
Вывод:
10010011

Ввод:
2
011000000111
Вывод:
607

Вначале программа должна спрашивать у пользователя, какую задачу выполнить. 1 - перевод из десятичной, 2 - перевод в десятичную. 
В случае ввода некорректного числа программа должна выводить слово "Ошибка" и пояснить, что пошло не так.
*/
