#include "iotest.hpp"

int main() {
    test_num_array("4 0 2 2 0 0 0 1 2 0 1 0 2 2 0 0 0",                                         "1: 1 (4), 2: 2 (3), 2: 3 (3), 3: 4 (2)", KEEP_ORDER);
    test_num_array("3 0 2 1 0 0 2 1 0 0",                                                       "1: 1 (3), 2: 2 (2), 3: 3 (1)", KEEP_ORDER);
    test_num_array("4 0 1 1 1 1 0 1 1 1 1 0 1 1 1 1 0",                                         "1: 1 (3), 1: 2 (3), 1: 3 (3), 1: 4 (3)", KEEP_ORDER);
    test_num_array("4 0 2 2 2 0 0 0 0 0 2 0 0 0 2 2 0",                                         "1: 1 (6), 2: 4 (4), 3: 3 (2), 4: 2 (0)", KEEP_ORDER);
    test_num_array("5 0 2 1 0 2 0 0 2 1 0 1 0 0 2 1 2 1 0 0 2 0 2 1 0 0",                       "1: 1 (5), 1: 4 (5), 2: 3 (4), 3: 2 (3), 3: 5 (3)", KEEP_ORDER);
    test_num_array("2 0 0 2 0",                                                                 "1: 2 (2), 2: 1 (0)", KEEP_ORDER);
    test_num_array("6 0 2 1 2 0 1 0 0 2 1 1 2 1 0 0 2 0 1 0 1 0 0 2 2 2 1 2 0 0 1 1 0 1 0 1 0", "1: 1 (6), 1: 2 (6), 1: 5 (6), 2: 4 (5), 3: 3 (4), 4: 6 (3)", KEEP_ORDER);
    test_contains("-1",                                                                         "Ошибка");
}

/*
Ввод:
4
0 2 2 0
0 0 1 2
0 1 0 2
2 0 0 0
Вывод:
1 место: Команда 1 (Очки: 4)
2 место: Команда 2 (Очки: 3)
2 место: Команда 3 (Очки: 3)
3 место: Команда 4 (Очки: 2)

В случае ввода некорректного числа программа должна выводить слово "Ошибка" и пояснить, что пошло не так.
*/
