#include "iotest.hpp"

int main() {
    test_num_array("", "55252 S[0] = 1 S[1] = 3 S[2] = 6 S[3] = 10 S[4] = 15 S[5] = 21 S[6] = 28 S[7] = 36 S[8] = 45 S[9] = 55 S[10] = 63 S[11] = 69 S[12] = 73 S[13] = 75 S[14] = 75 S[15] = 73 S[16] = 69 S[17] = 63 S[18] = 55 S[19] = 45 S[20] = 36 S[21] = 28 S[22] = 21 S[23] = 15 S[24] = 10 S[25] = 6 S[26] = 3 S[27] = 1", KEEP_ORDER);
}

/*
Ввод:

Вывод:
Число счастливых билетов: ..
S[0] = 1
S[1] = 3
S[2] = 6
...

Необходимо вывести количество счастливых билетов по суммам цифр (1-27).
Билет №000000 существует :)
*/
