#include "iotest.hpp"

int main() {
    test_num_array("5 0 0 4 0 5 3 2.5 5 0 3",                         "18.5");
    test_num_array("4 0 0 4 0 4 4 0 4",                               "16");
    test_num_array("4 0 0 6 0 6 3 0 3",                               "18");
    test_num_array("4 0 0 6 0 5 3 1 3",                               "15");
    test_num_array("3 0 0 5 0 2 4",                                   "10");
    test_num_array("6 2 0 4 0 5 1.732 4 3.464 2 3.464 1 1.732",       "10.392");
    test_num_array("8 0 0 3 0 5.4 2 5 5 3 7 0.1 7 -2.32 5 -2.32 2.5", "42.92");
    test_contains("-1",                                               "Ошибка");
    test_contains("2",                                                "Ошибка");
}

/*
Ввод:
5
0 0 4 0 5 3 2.5 5 0 3
Вывод:
18.5

Ввод:
4
0 0 4 0 4 4 0 4
Вывод:
16

Необходимо использовать вещественный тип данных с двойной точностью.
В случае ввода некорректного числа программа должна выводить слово "Ошибка" и пояснить, что пошло не так.
*/
