#include "iotest.hpp"

int main() {
    test_num_array("3 0 0 2 2 0 2 1 1 1",                    "8.5");
    test_num_array("1 0 0 2",                                "4");
    test_num_array("2 0 0 2 5 0 2",                          "8");
    test_num_array("2 0 0 4 3 0 4",                          "28");
    test_num_array("2 0 0 10 0 0 4",                         "100");
    test_num_array("3 0 0 6 0 0 6 0 0 6",                    "36");
    test_num_array("4 0 0 2 2 0 2 0 2 2 2 2 2",              "16");
    test_num_array("5 0 0.1 5 3 2 3 -2 -1 4.6 1 3 2 -3 1 3", "47.81");
    test_num_array("2 0 0 0 1 1 2",                          "4");
    test_contains("-1",                                      "Ошибка");
}

/*
Ввод:
3
0 0 2
2 0 2
1 1 1
Вывод:
x = 4
y = 0
z = 0

Необходимо использовать вещественный тип данных с двойной точностью.
В случае ввода некорректного числа программа должна выводить слово "Ошибка" и пояснить, что пошло не так.
*/
