#include "iotest.hpp"

int main() {
    test_num_array("6 5 2 3 2 5 1",                     "1 2 3 5 4");
    test_exact("5 10 20 30 40 50",                      "10 20 30 40 50 Повторяющихся элементов нет");
    test_num_array("6 7 7 7 7 7 7",                     "7 1");
    test_num_array("7 -3 5 -2 -3 0 5 4",                "-3 -2 0 4 5 5");
    test_num_array("10 90 91 92 -11 93 94 95 96 97 98", "90 91 92 -11 93 94 95 96 97 98 Повторяющихся элементов нет");
    test_num_array("100 5 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4", "4 5 2");
    test_contains("-1",                                 "Ошибка", OPTIONAL);
    test_contains("102",                                "Ошибка", OPTIONAL);
}
