#include "iotest.hpp"

int main() {
    test_exact("5 > 3 && 2 < 4", "ИСТИНА");
    test_exact("!(5 > 3)", "ЛОЖЬ");
    test_exact("x <= y\n3\n5", "ИСТИНА");
    test_exact("5 > 3", "ИСТИНА");
    test_exact("3 > 5", "ЛОЖЬ");
    test_exact("10 < 100", "ИСТИНА");
    test_exact("1000 < 100", "ЛОЖЬ");
    test_exact("2 == 5", "ЛОЖЬ");
    test_exact("7 == 7", "ИСТИНА");
    test_exact("10 != 10", "ЛОЖЬ");
    test_exact("512 != 1024", "ИСТИНА");
    test_exact("0 <= 0", "ИСТИНА");
    test_exact("67 <= 52", "ЛОЖЬ");
    test_exact("234432 >= 3232", "ИСТИНА");
    test_exact("144 >= 169", "ЛОЖЬ");
    test_exact("0", "ЛОЖЬ");
    test_exact("1", "ИСТИНА");
    test_exact("23", "ИСТИНА");
    test_exact("!0", "ИСТИНА");
    test_exact("!1", "ЛОЖЬ");
    test_exact("!5", "ЛОЖЬ");
    test_exact("!!1", "ИСТИНА");
    test_exact("0 && 0", "ЛОЖЬ");
    test_exact("0 && 1", "ЛОЖЬ");
    test_exact("5 && 1", "ИСТИНА");
    test_exact("0 || 0", "ЛОЖЬ");
    test_exact("0 || 1", "ИСТИНА");
    test_exact("1 || 1", "ИСТИНА");
    test_exact("5 > 3 && 2 > 4", "ЛОЖЬ");
    test_exact("5 > 3 || 2 > 4", "ИСТИНА");
    test_exact("5 < 3 || 2 > 4", "ЛОЖЬ");
    test_exact("!(5 > 3)", "ЛОЖЬ");
    test_exact("!x\n0", "ИСТИНА");
    test_exact("x > 5\n3", "ЛОЖЬ");
    test_exact("x == 10 || y > 5 && z != 3\n10\n7\n5", "ИСТИНА");
    test_exact("!((x > 5) && (y < 10))\n7\n8", "ЛОЖЬ");
    test_exact("(a > 10 && b < 5) || (c == 0 && d != 3) || e > 20\n5\n3\n1\n3\n15", "ЛОЖЬ");
    test_contains("5 >", "Ошибка");
    test_contains("(5 > 3", "Ошибка");
    test_contains("5 @ 3", "Ошибка");
}

/*
Ввод:
5 > 3 && 2 < 4
Вывод:
ИСТИНА

Ввод:
!(5 > 3)
Вывод:
ЛОЖЬ

Ввод:
x <= y
3       // x =
5       // y =
Вывод:
ИСТИНА

Используемые операторы: ==, !=, <, >, <=, >=, &&, ||, !, (, ). 
В случае ввода некорректных данных программа должна выводить слово "Ошибка" и пояснить, что пошло не так.
*/
