#include "iotest.hpp"

int main() {
    test_num_array("3 3 1 3 5 2 4 6 5 7 9 3 6 11",                                                      "3: A[1][2] 6: A[2][3] 11: не найден", KEEP_ORDER);
    test_num_array("3 3 1 2 2 2 3 4 4 5 6 2 4 6",                                                       "2: A[1][2] A[1][3] A[2][1] 4: A[2][3] A[3][1] 6: A[3][3]", KEEP_ORDER);
    test_num_array("4 4 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 3 7 11 15",                              "3: A[1][3] 7: A[2][3] 11: A[3][3] 15: A[4][3]", KEEP_ORDER);
    test_num_array("3 3 1 2 3 4 5 6 7 8 9 10 11 12",                                                    "10: не найден 11: не найден 12: не найден", KEEP_ORDER);
    test_num_array("4 5 -5.5 0 0 0 0 0 5.5 5.5 5.5 5.5 6 6 6 6 6 7.22 9.81 9.81 15 85 -5.5 9.81 40 85", "-5.5: A[1][1] 9.81: A[4][2] A[4][3] 40: не найден 85: A[4][5]", KEEP_ORDER);
    test_contains("-1 3",                                                                               "Ошибка");
}
