#include "iotest.hpp"

int main() {
    test_num_array("3 4 5 2 8 1 10 3 6 7 4 9 2 5",                         "10 3 6 7 4 9 2 5 5 2 8 1", KEEP_ORDER);
    test_num_array("3 4 5.2 2.1 8.7 1.3 10.5 3.4 6.1 7.8 4.9 9.6 2.2 5.4", "10.5 3.4 6.1 7.8 4.9 9.6 2.2 5.4 5.2 2.1 8.7 1.3", KEEP_ORDER);
    test_num_array("3 3 7 2 5 4 7 3 1 6 7",                                "7 2 5 4 7 3 1 6 7", KEEP_ORDER);
    test_num_array("4 3 -5 -2 -8 1 -10.5 3 -6.1 -7.15 10.2 -9.99 2 -5.1",  "-6.1 -7.15 10.2 1 -10.5 3 -9.99 2 -5.1 -5 -2 -8", KEEP_ORDER);
    test_num_array("1 1 42",                                               "42", KEEP_ORDER);
    test_num_array("2 5 1.2 9.8 3.4 7.6 5 -8.1 4.3 6.5 2.7 0.9",           "1.2 9.8 3.4 7.6 5 -8.1 4.3 6.5 2.7 0.9", KEEP_ORDER);
    test_contains("-1 1",                                                  "Ошибка");
    test_contains("1 -1",                                                  "Ошибка");
}

/*
Ввод:
3 4
5 2 8 1
10 3 6 7
4 9 2 5
Вывод:
10 3 6 7
4 9 2 5
5 2 8 1

В случае ввода некорректного числа программа должна выводить слово "Ошибка" и пояснить, что пошло не так.
*/

