#include "iotest.hpp"

int main() {
    test_num_array("3 1 2 3 4 5 6 7 8 9",                      "5 6 4 8 9 7 2 3 1", KEEP_ORDER);
    test_num_array("4 1 5 9 13 2 6 -2 14 3 7 11 15 4 8 12 16", "1 5 13 9 3 7 15 11 4 8 16 12 2 6 14 -2", KEEP_ORDER);
    test_num_array("3 8 3 5 2 6 4 1 9 7",                      "3 5 8 6 4 2 9 7 1", KEEP_ORDER);
    test_num_array("3 7 4 1 8 5 2 9 6 3",                      "8 5 2 9 6 3 7 4 1", KEEP_ORDER);
    test_num_array("5 3.14 2.71 1.41 1.73 0.57 4.25 -5.12 6.78 -2.22 3.33 -7.89 8.45 9.01 4.56 5.67 6.54 7.23 -3.45 8.91 2.34 9.87 1.23 4.78 5.89 6.12", "2.71 1.41 1.73 0.57 3.14 -5.12 6.78 -2.22 3.33 4.25 7.23 -3.45 8.91 2.34 6.54 1.23 4.78 5.89 6.12 9.87 8.45 9.01 4.56 5.67 -7.89", KEEP_ORDER);
    test_num_array("3 12 23 34 22 33 44 1 2 0",                "12 23 34 22 33 44 1 2 0", KEEP_ORDER);
    test_contains("-1",                                        "Ошибка");
}

/*
Ввод:
3
1 2 3
4 5 6
7 8 9
Вывод:
5 6 4
8 9 7
2 3 1

Для корректной работы тестов сначала нужно переместить строки, затем столбцы.
Первая строка не может быть переставлена с последней. Так же и со столбцами.
В случае ввода некорректного числа программа должна выводить слово "Ошибка" и пояснить, что пошло не так.
*/
