#include "iotest.hpp"

int main() {
    test_num_array("3 9 8 7 6 5 4 3 2 1",          "1 3 2 7 9 8 4 6 5", KEEP_ORDER);
    test_num_array("3 1 4 7 2 5 8 3 6 9",          "1 4 7 2 5 8 3 6 9", KEEP_ORDER);
    test_num_array("3 5 8 2 4 9 7 5 6 1",          "1 5 6 2 5 8 7 4 9", KEEP_ORDER);
    test_num_array("3 10 20 30 40 -5 60 70 80 90", "-5 60 40 80 90 70 20 30 10", KEEP_ORDER);
    test_num_array("4 3.1 5.2 7.3 9.4 2.2 4.3 6.4 8.5 1.1 3.2 5.3 7.4 0.5 2.3 4.4 6.6", "0.5 2.3 4.4 6.6 3.1 5.2 7.3 9.4 2.2 4.3 6.4 8.5 1.1 3.2 5.3 7.4", KEEP_ORDER);
    test_num_array("3 3 2 1 4 5 6 7 8 9",          "1 3 2 6 4 5 9 7 8", KEEP_ORDER);
    test_num_array("3 3 2 6 4 5 8 1 8 7",          "1 8 7 3 2 6 4 5 8", KEEP_ORDER);
    test_contains("-1", "Ошибка");
}

/*
Ввод:
3
9 8 7
6 5 4
3 2 1
Вывод:
1 3 2
7 9 8
4 6 5

Для корректной работы тестов сначала нужно переместить строки, затем столбцы.
В случае ввода некорректного числа программа должна выводить слово "Ошибка" и пояснить, что пошло не так.
*/
