#include "iotest.hpp"

int main() {
    test_exact("1 0 5 0 1 3",    "5 3");
    test_exact("1 2 3 1 0 0",    "0 1.5");
    test_exact("2 -1 1 1 1 4",   "1.66667 2.33333");
    test_exact("0 1 4 1 0 -2",   "-2 4");
    test_exact("1 2 3 1 2 5",    "Прямые не пересекаются");
    test_exact("2 4 6 1 2 4",    "Прямые не пересекаются");
    test_exact("0 1 3 0 1 7",    "Прямые не пересекаются");
    test_exact("1 0 2 1 0 5",    "Прямые не пересекаются");
    test_exact("1 2 3 2 4 6",    "Прямые совпадают");
    test_exact("0 1 3 0 2 5",    "Прямые совпадают");
    test_exact("1 0 5 3 0 15",   "Прямые совпадают");
    test_exact("0 0 0 0 0 0",    "Прямые совпадают");
    test_exact("0 0 5 1 2 3",    "Прямые не существуют");
    test_exact("1 2 3 0 0 7",    "Прямые не существуют");
    test_exact("0 0 5 0 0 7",    "Прямые не существуют");
    test_exact("-1 2 -3 2 -4 6", "Прямые совпадают");
    test_exact("0 2 4 0 -1 2",   "Прямые совпадают");
    test_exact("0 0 0 1 2 3",    "1x + 2y = 3");

    return 0;
}
